dks-project-repository/button-box/DCS/mfd/boards.txt
mfdbuttonbox_dbg.name=Arduino Due (Programming Port)
mfdbuttonbox_dbg.build.usb_manufacturer="Arduino LLC"
mfdbuttonbox_dbg.build.usb_product="MFD ButtonBox KY"
mfdbuttonbox_dbg.build.pid=0x003f

mfdbuttonbox_dbg.vid.0=0x2341
mfdbuttonbox_dbg.pid.0=0x003d
mfdbuttonbox_dbg.vid.1=0x2A03
mfdbuttonbox_dbg.pid.1=0x003d
mfdbuttonbox_dbg.upload.tool=bossac
mfdbuttonbox_dbg.upload.protocol=sam-ba
mfdbuttonbox_dbg.upload.maximum_size=524288
mfdbuttonbox_dbg.upload.use_1200bps_touch=true
mfdbuttonbox_dbg.upload.wait_for_upload_port=false
mfdbuttonbox_dbg.upload.native_usb=false
mfdbuttonbox_dbg.build.mcu=cortex-m3
mfdbuttonbox_dbg.build.f_cpu=84000000L
mfdbuttonbox_dbg.build.board=SAM_DUE
mfdbuttonbox_dbg.build.core=arduino
mfdbuttonbox_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
mfdbuttonbox_dbg.build.ldscript=linker_scripts/gcc/flash.ld
mfdbuttonbox_dbg.build.variant=arduino_due_x
mfdbuttonbox_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
mfdbuttonbox_dbg.build.vid=0x2341

mfdbuttonbox.name=Arduino Due (Native USB Port)
mfdbuttonbox.build.usb_manufacturer="Arduino LLC"
mfdbuttonbox.build.usb_product="MFD ButtonBox KY"
mfdbuttonbox.build.pid=0x003f

mfdbuttonbox.vid.0=0x2341
mfdbuttonbox.pid.0=0x003e
mfdbuttonbox.vid.1=0x2A03
mfdbuttonbox.pid.1=0x003e
mfdbuttonbox.upload.tool=bossac
mfdbuttonbox.upload.protocol=sam-ba
mfdbuttonbox.upload.maximum_size=524288
mfdbuttonbox.upload.use_1200bps_touch=true
mfdbuttonbox.upload.wait_for_upload_port=true
mfdbuttonbox.upload.native_usb=true
mfdbuttonbox.build.mcu=cortex-m3
mfdbuttonbox.build.f_cpu=84000000L
mfdbuttonbox.build.board=SAM_DUE
mfdbuttonbox.build.core=arduino
mfdbuttonbox.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
mfdbuttonbox.build.ldscript=linker_scripts/gcc/flash.ld
mfdbuttonbox.build.variant=arduino_due_x
mfdbuttonbox.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
mfdbuttonbox.build.vid=0x2341